#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <TXLib.h>

int main()
{
    double a=0,b=0,c=0,D=0;
    char ch = 'A';

    while (ch != 'Q'){

    printf("Программа для решения квадратного уравнения. Введите коэффиценты через пробел:\n");

    scanf("%lf %lf %lf",&a,&b,&c);

    D=b*b-4*a*c; // Поиск Дискриминанта

    if(a==0 && b!=0){ // Если уравнение линейное
        double x;
        x=(double)-c/b;
        printf("Корень уравнения:%.2lf.\nДля выхода введите Q.\nЧтобы продолжить введите любой символ:",x);
        }

    else if(a==0 && b == 0){
        if (c==0){
            printf("Корней бесконечное количество.\nДля выхода введите Q.\nЧтобы продолжить введите любой символ:");
            }
        if (c!=0){
        printf("Корней нет.\nДля выхода введите Q.\nЧтобы продолжить введите любой символ:");
            }
    }

    else{          // Если уравнения квадратное
        if(D>0){
            double x1,x2;
            x1=(double)(-b+sqrt(D))/(2*a); //Поиск корней уравнения
            x2=(double)(-b-sqrt(D))/(2*a);
            printf("Корни уравнения: x1=%.2lf x2=%.2lf.\nДля выхода введите Q.\nЧтобы продолжить введите любой символ:",x1,x2);
        }

        else if(D==0){
            double x;
            x=(double)-b/(2*a);
            printf("Корень уравнения: x=%.2lf.\nДля выхода введите Q.\nЧтобы продолжить введите любой символ:",x);
        }

        else{
        printf("Корней нет.\nДля выхода введите Q.\nЧтобы продолжить введите любой символ:");
        }
    }

    scanf(" %c",&ch);
   }
}

